const words = ["こたつ","馬車","相槌","添い寝","柔らかな","マフラー","特別",
    "ほろ苦い","風邪","身を寄せる","手袋","見慣れた","寒い","傍にいて","溢れそうな",
    "雪","いつも通り","あたためる","甘やかな","静かな","雪うさぎ","星空","拗ねる",
    "手芸","見つめる","かまくら","白い息","言えない","ソファ","半分こ","ココア",
    "見上げる","心音","パッチワーク","目を伏せる","お餅","きっかけ","眠れない",
    "取り繕わない","強がり","手を繋ぐ","隣","温泉","素顔","いつの間にか","恋人繋ぎ",
    "腕の中","背伸び","本音","照れ隠し","内緒","ぬくもり","影","隠しごと","満足げな",
    "指切り","微笑む","眠気","ラッピング","一目惚れ","プレゼント","甘やかす","引き寄せて",
    "学生時代","信頼","ハグ","無意識","隠しても","制服","裏返し","ヘアアレンジ","大切",
    "袖をひく","思い出","二人きり","みかん","とびきりの","メレンゲ","余裕","２回目の",
    "おやすみ","瞳","砂糖菓子","抱きしめる","もう一度","コート","耳打ち","ふわふわ",
    "抱きつく","告白","耳あて","お世話","恋心","ほっとする","眠ったふり","ピアス","鼻歌",
    "やきもち","一息","安心","ぬいぐるみ","隠して","寂しい","休憩","ほっこり","ラテアート",
    "イルミネーション","秘密","ひとやすみ","手探り","クッキー","きらきら","こっそり","隣",
    "距離","めがね","輝く","頬を染める","雨音","それでも","上着","流れ星","キス","はじめて",
    "顔を寄せる","撫でる","触れる","くすぐったい","もどかしい","ささやく","このまま",
    "ひとりじめ","臆病","嘘つき","覚悟","上機嫌","寄り添う","名前","呼び捨て","デート",
    "おしゃれ","足りない","だって","居心地","距離感","真っ白","気付かないふり","魔法",
    "気持ち","ベッド","苦笑","本当は","願いごと","香り","前から","ほんのり","色づく",
    "口実","夢","悪夢","唇","見蕩れる","おやすみ","眠るまで","可愛らしい","きっと","お菓子",
    "貴方/君のため","スイーツ","あーん","お誘い","結んだ","リラックス","一瞬","指の先",
    "くすくすと","嬉しそうに","振り返る","見繕う","気まぐれ","髪をほどく","うなじ","お手入れ",
    "不器用","愛おしい","今だけ","許す","人目につかない","珍しい","花冠","膝枕","頭を撫でる",
    "いつもと違う"]; // 仮	

const bg = document.querySelector(".bg");
const select = document.querySelector(".select");
const wordEl = document.getElementById("word");
const card = document.querySelector(".card");

// ページ読み込み時に初期クラスを追加
window.addEventListener("DOMContentLoaded", () => {
  bg.classList.add("initial");
});

function showBg(type) {
  // 背景切り替え
  bg.classList.remove("a", "b", "zoom","initial");
  void bg.offsetWidth;
  bg.classList.add(type, "zoom");

  select.style.display = "none";
  card.style.display = "flex";

  // ★次のフレームでアニメーション開始
  requestAnimationFrame(() => {
    card.classList.add("show");
  });
}

document.getElementById("bg1").onclick = () => showBg("a");
document.getElementById("bg2").onclick = () => showBg("b");

function drawWord() {
  const i = Math.floor(Math.random() * words.length);
  wordEl.textContent = words[i];
}



